---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentColor
source: html/453a6e0e-e390-ad9e-172d-48ce36e6672d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentColor Property

"End Segment Color"

## Syntax (C#)
```csharp
public static ForgeTypeId GridEndSegmentColor { get; }
```